src/test/resources/xpath.root/xpath-anti-pattern.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.9" jmeter="3.0 r1743807">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1474258445000</longProp>
        <longProp name="ThreadGroup.end_time">1474258445000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="XPath Sampler 01" enabled="false">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="classname">com.github.eostermueller.xpath.XPathSampler01</stringProp>
        </JavaSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1572">15</stringProp>
              <stringProp name="1576">19</stringProp>
              <stringProp name="1630">31</stringProp>
              <stringProp name="48910">196</stringProp>
              <stringProp name="49623">216</stringProp>
              <stringProp name="49679">230</stringProp>
              <stringProp name="804868933">Anh.107</stringProp>
              <stringProp name="804868934">Anh.108</stringProp>
              <stringProp name="804869082">Anh.151</stringProp>
              <stringProp name="69829">G20</stringProp>
              <stringProp name="69832">G23</stringProp>
              <stringProp name="69835">G26</stringProp>
              <stringProp name="2251">G2</stringProp>
              <stringProp name="69837">G28</stringProp>
              <stringProp name="69833">G24</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="XPath Sampler 02" enabled="false">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="classname">com.github.eostermueller.xpath.XPathSampler02</stringProp>
        </JavaSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1572">15</stringProp>
              <stringProp name="1576">19</stringProp>
              <stringProp name="1630">31</stringProp>
              <stringProp name="48910">196</stringProp>
              <stringProp name="49623">216</stringProp>
              <stringProp name="49679">230</stringProp>
              <stringProp name="804868933">Anh.107</stringProp>
              <stringProp name="804868934">Anh.108</stringProp>
              <stringProp name="804869082">Anh.151</stringProp>
              <stringProp name="69829">G20</stringProp>
              <stringProp name="69832">G23</stringProp>
              <stringProp name="69835">G26</stringProp>
              <stringProp name="2251">G2</stringProp>
              <stringProp name="69837">G28</stringProp>
              <stringProp name="69833">G24</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="XPath Sampler 03" enabled="false">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="classname">com.github.eostermueller.xpath.XPathSampler03</stringProp>
        </JavaSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1572">15</stringProp>
              <stringProp name="1576">19</stringProp>
              <stringProp name="1630">31</stringProp>
              <stringProp name="48910">196</stringProp>
              <stringProp name="49623">216</stringProp>
              <stringProp name="49679">230</stringProp>
              <stringProp name="804868933">Anh.107</stringProp>
              <stringProp name="804868934">Anh.108</stringProp>
              <stringProp name="804869082">Anh.151</stringProp>
              <stringProp name="69829">G20</stringProp>
              <stringProp name="69832">G23</stringProp>
              <stringProp name="69835">G26</stringProp>
              <stringProp name="2251">G2</stringProp>
              <stringProp name="69837">G28</stringProp>
              <stringProp name="69833">G24</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="XPath Sampler 04" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="classname">com.github.eostermueller.xpath.XPathSampler04</stringProp>
        </JavaSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1572">15</stringProp>
              <stringProp name="1576">19</stringProp>
              <stringProp name="1630">31</stringProp>
              <stringProp name="48910">196</stringProp>
              <stringProp name="49623">216</stringProp>
              <stringProp name="49679">230</stringProp>
              <stringProp name="804868933">Anh.107</stringProp>
              <stringProp name="804868934">Anh.108</stringProp>
              <stringProp name="804869082">Anh.151</stringProp>
              <stringProp name="69829">G20</stringProp>
              <stringProp name="69832">G23</stringProp>
              <stringProp name="69835">G26</stringProp>
              <stringProp name="2251">G2</stringProp>
              <stringProp name="69837">G28</stringProp>
              <stringProp name="69833">G24</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">true</boolProp>
      </ResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>